# Merge , Join and concate

<img src="../Datasets/join-or-merge-in-python-pandas-1.webp" alt="Alt Text" width="1000">

In [1]:
import pandas as pd

In [3]:
df1 = pd.read_csv(r'../Datasets/LOTR.csv')
df2 = pd.read_csv(r'../Datasets/LOTR 2.csv')

In [4]:
df1

   FellowshipID FirstName     Skills
0          1001     Frodo     Hiding
1          1002   Samwise  Gardening
2          1003   Gandalf     Spells
3          1004    Pippin  Fireworks

In [5]:
df2

   FellowshipID FirstName   Age
0          1001     Frodo    50
1          1002   Samwise    39
2          1006   Legolas  2931
3          1007    Elrond  6520
4          1008  Barromir    51